linux/.emacs.d/basic.org
  #+BEGIN_SRC emacs-lisp
  (org-babel-load-file (expand-file-name "basic.org" "~/personal/dotfiles/common/.emacs.d/"))
  #+END_SRC

* Basic

  * the ability to comment stuff easily

  #+BEGIN_SRC emacs-lisp
    (eval-after-load 'evil-maps
    (dolist (map '(evil-motion-state-map
    evil-normal-state-map
    evil-insert-state-map
    evil-emacs-state-map))
    (define-key (eval map) (kbd "C-/") nil)
    (define-key (eval map) (kbd "C-n") nil)
    (define-key (eval map) (kbd "C-z") nil)
    (define-key (eval map) (kbd "C-e") nil))
    (define-key (eval map) "\C-e" nil))

    (global-set-key (kbd "C-/") nil)
    (global-set-key (kbd "C-z") nil)
    (define-key undo-tree-map (kbd "C-/") nil)
    
    (global-set-key (kbd "C-z") 'undo)
    (global-set-key (kbd "C-/") 'comment-or-uncomment-region-or-line)
  #+END_SRC

      (define-key evil-normal-state-map (kbd "C-n") nil)

    (with-eval-after-load 'evil-maps
      (define-key evil-normal-state-map (kbd "C-n") nil)
      (define-key evil-normal-state-map (kbd "C-p") nil))

(with-eval-after-load 'evil-maps
  (define-key evil-normal-state-map (kbd "C-n") nil)
  (define-key evil-normal-state-map (kbd "C-p") nil))


